name dense_1 128 swish
name dense_2 47 swish
name dense_3 17 swish
name dense_4 47 swish
name U_0 1 linear
name U_1 1 linear
name U_2 1 linear
name div_phi_ 1 linear
name Res_0 1 linear
name Res_1 1 linear
name Res_2 1 linear
name U_mag 1 linear
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Inlet_U (InputLayer)            (None, 1649, 1)      0                                            
__________________________________________________________________________________________________
Points_0 (InputLayer)           (None, 1649, 1)      0                                            
__________________________________________________________________________________________________
Points_2 (InputLayer)           (None, 1649, 1)      0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1649, 3)      0           Inlet_U[0][0]                    
                                                                 Points_0[0][0]                   
                                                                 Points_2[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1649, 128)    512         concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1649, 128)    512         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1649, 47)     6063        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1649, 47)     188         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1649, 17)     816         batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 1649, 17)     68          dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1649, 47)     846         batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1649, 47)     188         dense_4[0][0]                    
__________________________________________________________________________________________________
U_0 (Dense)                     (None, 1649, 1)      48          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
U_1 (Dense)                     (None, 1649, 1)      48          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
U_2 (Dense)                     (None, 1649, 1)      48          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
div_phi_ (Dense)                (None, 1649, 1)      48          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
Res_0 (Dense)                   (None, 1649, 1)      48          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
Res_1 (Dense)                   (None, 1649, 1)      48          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
Res_2 (Dense)                   (None, 1649, 1)      48          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
U_mag (Dense)                   (None, 1649, 1)      48          batch_normalization_4[0][0]      
==================================================================================================
Total params: 9,577
Trainable params: 9,099
Non-trainable params: 478
__________________________________________________________________________________________________
